package com.company;

import java.util.ArrayList;
import java.util.Date;
import java.util.HashMap;
import java.util.Map;

public class DataGenerator {
    public static String[] listManNames = {"Август", "Агап", "Агафон", "Адам", "Адриан", "Азарий", "Аким", "Алан",
            "Александр", "Алексей", "Альберт", "Анатолий", "Андрей", "Антип", "Антон", "Анфим", "Аполлинарий", "Арий",
            "Аристарх", "Аркадий", "Арно", "Арнольд", "Арсений", "Артем", "Артемий", "Артур", "Архип", "Афанасий",
            "Боголюб", "Болеслав", "Борис", "Борислав", "Бронислав", "Вадим", "Валентин", "Валерий", "Вальдемар",
            "Варфоломей", "Василий", "Ватслав", "Велизар", "Венедикт", "Вениамин", "Викентий", "Виктор", "Вилен",
            "Виссарион", "Виталий", "Владимир", "Владислав", "Владлен", "Власий", "Володар", "Всеволод", "Вячеслав",
            "Гектор", "Геннадий", "Георгий", "Герасим", "Герман", "Глеб", "Горислав", "Григорий", "Даниил", "Данислав",
            "Демид", "Демьян", "Денис", "Дмитрий", "Добрыня", "Дорофей", "Евгений", "Евграф", "Евдоким", "Евсей",
            "Евстафий", "Егор", "Елизар", "Елисей", "Емельян", "Еремей", "Ермак", "Ермил", "Ермолай", "Ерофей", "Ефим",
            "Ефрем", "Жан", "Захар", "Зигмунд", "Зиновий", "Зосима", "Зураб", "Иван", "Игнат", "Игнатий", "Игорь",
            "Илларион", "Илья", "Инокентий", "Ипполит", "Казимир", "Кай", "Камиль", "Ким", "Кир", "Кирилл", "Клавдий",
            "Клим", "Кондрат", "Константин", "Корней", "Корнелий", "Кузьма", "Лавр", "Лаврентий", "Лазарь", "Ларион",
            "Лев", "Леонард", "Леонид", "Леонтий", "Лука", "Лукьян", "Любомир", "Макар", "Макарий", "Максим", "Максимильян",
            "Марк", "Маркел", "Марсель", "Мартин", "Матвей", "Мечеслав", "Микула", "Милан", "Мирон", "Мирослав", "Митрофан",
            "Михаил", "Модест", "Мстислав", "Нестор", "Никанор", "Никита", "Никифор", "Никодим", "Никола", "Николай", "Олег",
            "Онисим", "Орест", "Осип", "Остап", "Павел", "Панкрат", "Парамон", "Пахом", "Петр", "Порфирий", "Потап",
            "Прокофий", "Прохор", "Радомир", "Радослав", "Рафаэль", "Ренат", "Роберт", "Родион", "Ролан", "Роман",
            "Ростислав", "Рудольф", "Савелий", "Светозар", "Святослав", "Семен", "Серафим", "Сергей", "Спартак", "Спиридон",
            "Станислав", "Степан", "Стефан", "Тарас", "Терентий", "Тимофей", "Тихомир", "Тихон", "Трифон", "Трофим",
            "Ульян", "Устин", "Федор", "Федот", "Феликс", "Феофан", "Филарет", "Филат", "Филимон", "Филипп", "Фирс",
            "Фома", "Фрол", "Харитон", "Эдуард", "Эмилий", "Эраст", "Эрик", "Эрнест", "Юлиан", "Юлий", "Юрий", "Юст", "Яков",
            "Ян", "Януарий", "Яромир", "Ярослав"};
    public static String[] listManSurnames = {"Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев", "Петров",
            "Соколов", "Михайлов", "Новиков", "Федоров", "Морозов", "Волков", "Алексеев", "Лебедев", "Семенов",
            "Егоров", "Павлов", "Козлов", "Степанов", "Николаев", "Орлов", "Андреев", "Макаров", "Никитин",
            "Захаров", "Зайцев", "Соловьев", "Борисов", "Яковлев", "Григорьев", "Романов", "Воробьев", "Сергеев",
            "Кузьмин", "Фролов", "Александров", "Дмитриев", "Королев", "Гусев", "Киселев", "Ильин", "Максимов",
            "Поляков", "Сорокин", "Виноградов", "Ковалев", "Белов", "Медведев", "Антонов", "Тарасов", "Жуков", "Баранов",
            "Филиппов", "Комаров", "Давыдов", "Беляев", "Герасимов", "Богданов", "Осипов", "Сидоров", "Матвеев", "Титов",
            "Марков", "Миронов", "Крылов", "Куликов", "Карпов", "Власов", "Мельников", "Денисов", "Гаврилов", "Тихонов",
            "Казаков", "Афанасьев", "Данилов", "Савельев", "Тимофеев", "Фомин", "Чернов", "Абрамов", "Мартынов", "Ефимов",
            "Федотов", "Щербаков", "Назаров", "Калинин", "Исаев", "Чернышев", "Быков", "Маслов", "Родионов", "Коновалов",
            "Лазарев", "Воронин", "Климов", "Филатов", "Пономарев", "Голубев", "Кудрявцев", "Прохоров", "Наумов", "Потапов",
            "Журавлев", "Овчинников", "Трофимов", "Леонов", "Соболев", "Ермаков", "Колесников", "Гончаров", "Емельянов",
            "Никифоров", "Грачев", "Котов", "Гришин", "Ефремов", "Архипов", "Громов", "Кириллов", "Малышев", "Панов",
            "Моисеев", "Румянцев", "Акимов", "Кондратьев", "Бирюков", "Горбунов", "Анисимов", "Еремин", "Тихомиров",
            "Галкин", "Лукьянов", "Михеев", "Скворцов", "Юдин", "Белоусов", "Нестеров", "Симонов", "Прокофьев", "Харитонов",
            "Князев", "Цветков", "Левин", "Митрофанов", "Воронов", "Аксенов", "Софронов", "Мальцев", "Логинов", "Горшков",
            "Савин", "Краснов", "Майоров", "Демидов", "Елисеев", "Рыбаков", "Сафонов", "Плотников", "Демин", "Фадеев",
            "Молчанов", "Игнатов", "Литвинов", "Ершов", "Ушаков", "Дементьев", "Рябов", "Мухин", "Калашников", "Леонтьев",
            "Лобанов", "Кузин", "Корнеев", "Евдокимов", "Бородин", "Платонов", "Некрасов", "Балашов", "Бобров", "Жданов",
            "Блинов", "Игнатьев", "Коротков", "Муравьев", "Крюков", "Беляков", "Богомолов", "Дроздов", "Лавров", "Зуев",
            "Петухов", "Ларин", "Никулин", "Серов", "Терентьев", "Зотов", "Устинов", "Фокин", "Самойлов", "Константинов",
            "Сахаров", "Шишкин", "Самсонов", "Черкасов", "Чистяков", "Носов", "Спиридонов", "Карасев", "Авдеев",
            "Воронцов", "Зверев", "Владимиров", "Селезнев", "Нечаев", "Кудряшов", "Седов", "Фирсов", "Андрианов",
            "Панин", "Головин", "Терехов", "Ульянов", "Шестаков", "Агеев", "Никонов", "Селиванов", "Баженов", "Гордеев",
            "Кожевников", "Пахомов", "Зимин", "Костин", "Широков", "Филимонов", "Ларионов", "Овсянников", "Сазонов",
            "Суворов", "Нефедов", "Корнилов", "Любимов", "Львов", "Горбачев", "Копылов", "Лукин", "Токарев", "Кулешов",
            "Шилов", "Большаков", "Панкратов", "Родин", "Шаповалов", "Покровский", "Бочаров", "Никольский", "Маркин",
            "Горелов", "Агафонов", "Березин", "Ермолаев", "Зубков", "Куприянов", "Трифонов", "Масленников", "Круглов",
            "Третьяков", "Колосов", "Рожков", "Артамонов", "Шмелев", "Лаптев", "Лапшин", "Федосеев", "Зиновьев", "Зорин",
            "Уткин", "Столяров", "Зубов", "Ткачев", "Дорофеев", "Антипов", "Завьялов", "Свиридов", "Золотарев", "Кулаков",
            "Мещеряков", "Макеев", "Дьяконов", "Гуляев", "Петровский", "Бондарев", "Поздняков", "Панфилов", "Кочетков",
            "Суханов", "Рыжов", "Старостин", "Калмыков", "Колесов", "Золотов", "Кравцов", "Субботин", "Шубин", "Щукин",
            "Лосев", "Винокуров", "Лапин", "Парфенов", "Исаков", "Голованов", "Коровин", "Розанов", "Артемов", "Козырев",
            "Русаков", "Алешин", "Крючков", "Булгаков", "Кошелев", "Сычев", "Синицын", "Черных", "Рогов", "Кононов",
            "Лаврентьев", "Евсеев", "Пименов", "Пантелеев", "Горячев", "Аникин", "Лопатин", "Рудаков", "Одинцов", "Серебряков",
            "Панков", "Дегтярев", "Орехов", "Царев", "Шувалов", "Кондрашов", "Горюнов", "Дубровин", "Голиков", "Курочкин",
            "Латышев", "Севастьянов", "Вавилов", "Ерофеев", "Сальников", "Клюев", "Носков", "Озеров", "Кольцов",
            "Комиссаров", "Меркулов", "Киреев", "Хомяков", "Булатов", "Ананьев", "Буров", "Шапошников", "Дружинин",
            "Островский", "Шевелев", "Долгов", "Суслов", "Шевцов", "Пастухов", "Рубцов", "Бычков", "Глебов", "Ильинский",
            "Успенский", "Дьяков", "Кочетов", "Вишневский", "Высоцкий", "Глухов", "Дубов", "Бессонов", "Ситников",
            "Астафьев", "Мешков", "Шаров", "Яшин", "Козловский", "Туманов", "Басов", "Корчагин", "Болдырев", "Олейников",
            "Чумаков", "Фомичев", "Губанов", "Дубинин", "Шульгин", "Касаткин", "Пирогов", "Семин", "Трошин", "Горохов",
            "Стариков", "Щеглов", "Фетисов", "Колпаков", "Чесноков", "Зыков", "Верещагин", "Минаев", "Руднев", "Троицкий",
            "Окулов", "Ширяев", "Малинин", "Черепанов", "Измайлов", "Алехин", "Зеленин", "Касьянов", "Пугачев", "Павловский",
            "Чижов", "Кондратов", "Воронков", "Капустин", "Сотников", "Демьянов", "Косарев", "Беликов", "Сухарев", "Белкин",
            "Беспалов", "Кулагин", "Савицкий", "Жаров", "Хромов", "Еремеев", "Карташов", "Астахов", "Русанов", "Сухов",
            "Вешняков", "Волошин", "Козин", "Худяков", "Жилин", "Малахов", "Сизов", "Ежов", "Толкачев", "Анохин", "Вдовин",
            "Бабушкин", "Усов", "Лыков", "Горлов", "Коршунов", "Маркелов", "Постников", "Черный", "Дорохов", "Свешников",
            "Гущин", "Калугин", "Блохин", "Сурков", "Кочергин", "Греков", "Казанцев", "Швецов", "Ермилов", "Парамонов",
            "Агапов", "Минин", "Корнев", "Черняев", "Гуров", "Ермолов", "Сомов", "Добрынин", "Барсуков", "Глушков",
            "Чеботарев", "Москвин", "Уваров", "Безруков", "Муратов", "Раков", "Снегирев", "Гладков", "Злобин", "Моргунов",
            "Поликарпов", "Рябинин", "Судаков", "Кукушкин", "Калачев", "Грибов", "Елизаров", "Звягинцев", "Корольков",
            "Федосов"};
    public static String[] listManPatronymics = {"Ааронович", "Абрамович", "Августович", "Авдеевич", "Аверьянович",
            "Адамович", "Адрианович", "Акимович", "Аксёнович", "Александрович", "Алексеевич", "Анатольевич", "Андреевич",
            "Андроникович", "Анисимович", "Антипович", "Антонович", "Ануфриевич", "Аркадьевич", "Арсенович", "Арсеньевич",
            "Артёмович", "Артемьевич", "Артурович", "Архипович", "Афанасьевич", "Батькович", "Бедросович", "Бенедиктович",
            "Богданович", "Бориславич", "Бориславович", "Борисович", "Борисыч", "Брониславович", "Ваганович", "Вадимович",
            "Валентинович", "Валерианович", "Валерьевич", "Валерьянович", "Васильевич", "Вахтангович", "Венедиктович",
            "Вениаминович", "Викентьевич", "Викторович", "Виленович", "Вилорович", "Виссарионович", "Витальевич",
            "Владиленович", "Владимирович", "Владиславович", "Владленович", "Власович", "Вольфович", "Всеволодович",
            "Вячеславович", "Гавриилович", "Гаврилович", "Гаджиевич", "Геннадиевич", "Геннадьевич", "Генрихович",
            "Георгиевич", "Герасимович", "Германович", "Гертрудович", "Глебович", "Гордеевич", "Григорьевич", "Гурьевич",
            "Давидович", "Давыдович", "Даниилович", "Данилович", "Демидович", "Демьянович", "Денисович", "Димитриевич",
            "Дмитриевич", "Дорофеевич", "Евгеньевич", "Евграфович", "Евдокимович", "Евсеевич", "Евстигнеевич", "Егорович",
            "Елизарович", "Елисеевич", "Емельянович", "Еремеевич", "Ермилович", "Ермолаевич", "Ерофеевич", "Ефимович",
            "Ефимьевич", "Ефремович", "Ефстафьевич", "Жанович", "Жоресович", "Захарович", "Захарьевич", "Зиновьевич",
            "Ибрагимович", "Иванович", "Иваныч", "Игнатович", "Игнатьевич", "Игоревич", "Измаилович", "Изотович",
            "Израилевич", "Иларионович", "Ильгизович", "Ильич", "Ильмирович", "Ильнурович", "Ильсурович", "Ильясович",
            "Иоаннович", "Иосипович", "Иосифович", "Исаевич", "Исидорович", "Каллиникович", "Каллистратович",
            "Константинович", "Леонидович", "Леонович", "Леонтьевич", "Львович", "Магомедович", "Магометович",
            "Макарович", "Максимилианович", "Максимович", "Маркович", "Матвеевич", "Михайлович", "Михалыч", "Натанович",
            "Наумович", "Никандрович", "Никанорович", "Никитич", "Никитович", "Никифорович", "Никодимович", "Николаевич",
            "Никонович", "Олегович", "Осипович", "Павлович", "Петрович", "Платонович", "Прохорович", "Романович",
            "Ростиславович", "Рудольфович", "Русланович", "Рустамович", "Семёнович", "Сергеевич", "Сидорович",
            "Сильвестрович", "Соломонович", "Степанович", "Тарасович", "Теймуразович", "Терентьевич", "Тимофеевич",
            "Тимурович", "Тихонович", "Трифонович", "Трофимович", "Устинович", "Фадеевич", "Фёдорович", "Федосеевич",
            "Федосьевич", "Федотович", "Феликсович", "Феодосьевич", "Феоктистович", "Феофанович", "Филатович", "Филимонович",
            "Филиппович", "Фокич", "Фомич", "Фролович", "Харитонович", "Харламович", "Харлампович", "Харлампьевич",
            "Чеславович", "Эдгардович", "Эдгарович"};
    public static String[] listFemaleNames = {"Августа", "Авдотья", "Аврора", "Агата", "Аглая", "Агнесса", "Агния",
            "Ада", "Адель", "Аза", "Азалия", "Аида", "Аксинья", "Акулина", "Алевтина", "Александра", "Алексия", "Алёна",
            "Алина", "Алиса", "Алла", "Альберта", "Амалия", "Анастасия", "Ангелина", "Андриана", "Анеля", "Анжела",
            "Анжелика", "Анисья", "Анита", "Анна", "Антонина", "Анфиса", "Апрелия", "Ариадна", "Арина", "Арсения",
            "Ассоль", "Астра", "Ася", "Аурика", "Аэлита", "Бажена", "Беата", "Беатриса", "Белла", "Беляна", "Береслава",
            "Берта", "Богдана", "Божена", "Бронислава", "Валентина", "Валерия", "Ванда", "Ванесса", "Варвара", "Василина",
            "Василиса", "Васса", "Веда", "Венера", "Вера", "Вероника", "Веселина", "Веста", "Вета", "Вивиана", "Видана",
            "Виктория", "Вилора", "Виола", "Виринея", "Виталия", "Влада", "Владилена", "Владимира", "Владислава", "Власта",
            "Воля", "Всеслава", "Габриэлла", "Гайя", "Галина", "Гелия", "Гелла", "Гера", "Герда", "Глафира", "Глория",
            "Грация", "Грета", "Дайна", "Дана", "Даниэла", "Дарина", "Дарья", "Дарьяна", "Декабрина", "Дея", "Дженни",
            "Джулия", "Диана", "Дина", "Добрава", "Доля", "Доминика", "Дорофея", "Ева", "Евгения", "Евдокия", "Екатерина",
            "Елена", "Елизавета", "Емельяна", "Есения", "Ефимия", "Ефросиния", "Жанна", "Жасмин", "Ждана", "Забава", "Залина",
            "Зара", "Зарема", "Зарина", "Звана", "Звенислава", "Земфира", "Зинаида", "Зиновия", "Зита", "Злата", "Златослава",
            "Зоряна", "Зоя", "Иванна", "Ивона", "Ида", "Изабелла", "Изольда", "Илона", "Иля", "Инга", "Инесса", "Инна",
            "Иоанна", "Иоланта", "Ирина", "Ирма", "Искра", "Июлия", "Камилла", "Карина", "Каролина", "Катарина", "Кира",
            "Клавдия", "Клара", "Кристина", "Ксения", "Лада", "Лана", "Лара", "Лариса", "Лаура", "Леля", "Лера", "Леся",
            "Лиана", "Лидия", "Лика", "Лилиана", "Лилия", "Лина", "Линда", "Лира", "Лия", "Лолита", "Лора", "Луиза",
            "Любава", "Любовь", "Людмила", "Майя", "Малика", "Мальвина", "Маргарита", "Марианна", "Марина", "Мария",
            "Марта", "Матрена", "Мелания", "Мелисса", "Мила", "Милада", "Милана", "Милолика", "Милослава", "Мира",
            "Мирослава", "Мишель", "Мия", "Млада", "Моника", "Муза", "Надежда", "Нана", "Наталья", "Нева", "Нелли", "Ника",
            "Николина", "Николь", "Нила", "Нина", "Нинель", "Нона", "Оксана", "Олеся", "Олимпия", "Ольга", "Пелагея",
            "Полина", "Прасковья", "Рада", "Раиса", "Регина", "Рената", "Риана", "Римма", "Рита", "Роберта", "Рогнеда",
            "Роза", "Роксана", "Ростислава", "Рузана", "Руслана", "Руфина", "Сабрина", "Сандра", "Светлана", "Святослава",
            "Северина", "Селена", "Серафима", "Сильвия", "Слава", "Славяна", "Снежана", "Соня", "София", "Станислава",
            "Стелла", "Стефания", "Таисия", "Тамара", "Татьяна", "Ульяна", "Урсула", "Услада", "Устина", "Фаина", "Феба",
            "Фекла", "Фрида", "Хана", "Хельга", "Хлоя", "Христина", "Царина", "Цветана", "Цецилия", "Чулпан", "Шанель",
            "Шарлотта", "Шейла", "Эвелина", "Эдита", "Элеонора", "Элина", "Элла", "Элоиза", "Эльвира", "Эльза", "Эльмира",
            "Эмилия", "Эмма", "Эрика", "Эсмеральда", "Эстер", "Эшли", "Юлиана", "Юлия", "Юна", "Юния", "Юнона", "Ядвига",
            "Яна", "Янина", "Ярина", "Яромира", "Ярослава", "Ясмина"};
    public static String[] listFemaleSurnames = {"Иванова", "Петрова", "Смирнова", "Кузнецова", "Васильева", "Попова",
            "Новикова", "Волкова", "Романова", "Козлова", "Соколова", "Андреева", "Морозова", "Николаева", "Михайлова",
            "Павлова", "Алексеева", "Макарова", "Сергеева", "Егорова", "Орлова", "Александрова", "Степанова", "Никитина",
            "Лебедева", "Зайцева", "Захарова", "Яковлева", "Максимова", "Фролова", "Григорьева", "Шевченко", "Миронова",
            "Белова", "Мельникова", "Борисова", "Кузьмина", "Дмитриева", "Федорова", "Семенова", "Антонова", "Медведева",
            "Полякова", "Матвеева", "Тарасова", "Власова", "Жукова", "Коваленко", "Ильина", "Богданова", "Бондаренко",
            "Сорокина", "Кравченко", "Сидорова", "Данилова", "Котова", "Калинина", "Абрамова", "Осипова", "Колесникова",
            "Филиппова", "Руднева", "Титова", "Гончарова", "Куликова", "Давыдова", "Тимофеева", "Беляева", "Назарова",
            "Чернова", "Карпова", "Семёнова", "Гусева", "Денисова", "Фёдорова", "Маркова", "Ткаченко", "Фомина", "Соловьева",
            "Виноградова", "Александровна", "Ефимова", "Ковалева", "Афанасьева", "Тихонова", "Баранова", "Савельева",
            "Королева", "Филатова", "Исаева", "Казакова", "Малышева", "Федотова", "Гаврилова", "Климова", "Мельник",
            "Бойко", "Коновалова", "Щербакова", "Герасимова", "Мальцева", "Лазарева", "Комарова", "Ермакова", "Сергеевна",
            "Воробьева", "Крылова", "Наумова", "Ефремова", "Самойлова", "Ким", "Третьякова", "Ковалёва", "Голубева",
            "Кудрявцева", "Киселева", "Анисимова", "Трофимова", "Никифорова", "Мартынова", "Литвинова", "Нестерова",
            "Марченко", "Горбунова", "Алиева", "Потапова", "Князева", "Воронина", "Логинова", "Емельянова", "Цветкова",
            "Савченко", "Архипова", "Ковальчук", "Королёва", "Соболева", "Маслова", "Соловьёва", "Быкова", "Ларина",
            "Кириллова", "Леонова", "Овчинникова", "Белоусова", "Каримова", "Краснова", "Громова", "Савина", "Пономарева",
            "Демидова", "Некрасова", "Кожевникова", "Любимова", "Прохорова", "Гордеева", "Владимировна", "Руденко",
            "Симонова", "Юдина", "Родионова", "Ибрагимова", "Кондратьева", "Журавлева", "Плотникова", "Коваль", "Киселёва",
            "Жданова", "Моисеева", "Ершова", "Воробьёва", "Михеева", "Евдокимова", "Фадеева", "Гришина", "Петренко", "Панова",
            "Сафронова", "Елисеева", "Ушакова", "Игнатьева", "Суворова", "Клименко", "Кравцова", "Харитонова", "Авдеева",
            "Сафонова", "Бородина", "Карпович", "Зуева", "Сиваева", "Воронова", "Лобанова", "Калашникова", "Бирюкова",
            "Константинова", "Шевчук", "Сафина", "Рябова", "Шишкина", "Воронцова", "Сидоренко", "Шестакова", "Никулина",
            "Акимова", "Токарева", "Ермолаева", "Черных", "Галкина", "Костина", "Мороз", "Владимирова", "Казанцева", "Юсупова",
            "Лукьянова", "Киреева", "Павленко", "Румянцева", "Романенко", "Василенко", "Хасанова", "Кудряшова", "Ларионова",
            "Белая", "Скворцова", "Лысенко", "Лукина", "Терентьева", "Леонтьева", "Филимонова", "Малиновская", "Белякова",
            "Шакирова", "Левченко", "Карпенко", "Мишина", "Артемьева", "Олейник", "Бондарева", "Свиридова", "Самсонова",
            "Ульянова", "Мирошниченко", "Малахова", "Майорова", "Тихомирова", "Короткова", "Чернышова", "Колесник", "Ахметова",
            "Прекрасная", "Пономарёва", "Кузина", "Мамедова", "Кулакова", "Шаповалова", "Зотова", "Андреевна", "Молчанова",
            "Юрченко", "Круглова", "Бондарь", "Серова", "Дроздова", "Чистякова", "Петухова", "Агафонова", "Журавлёва",
            "Закирова", "Хохлова", "Головина", "Пронина", "Устинова", "Крюкова", "Приходько", "Игнатова", "Нечаева",
            "Вишневская", "Шевцова", "Исакова", "Пономаренко", "Маркина", "Кузьменко", "Лапина", "Зверева", "Носова",
            "Антипова", "Корнеева", "Большакова", "Спиридонова", "Никонова", "Харченко", "Пахомова", "Фокина", "Платонова",
            "Мухина", "Сазонова", "Шилова", "Черкасова", "Валеева", "Веселова", "Евсеева", "Малинина", "Тимошенко",
            "Нестеренко", "Дементьева", "Полищук", "Зимина", "Панина", "Макаренко", "Зорина", "Зарипова", "Рыбакова",
            "Панченко", "Литвиненко", "Шарипова", "Прокофьева", "Рожкова", "Кириченко", "Боброва", "Черепанова", "Садыкова",
            "Агеева", "Левина", "Копылова", "Ситникова", "Суханова", "Султанова", "Терехова", "Макеева", "Дорофеева",
            "Костенко", "Блинова", "Кошкина", "Волошина", "Кочеткова", "Назаренко", "Ткачук", "Валиева", "Селезнева",
            "Меркулова", "Демченко", "Горшкова", "Уварова", "Швец", "Позднякова", "Володина", "Субботина", "Терещенко",
            "Кононова", "Борисенко", "Высоцкая", "Солнцева", "Викторовна", "Шарапова", "Кравчук", "Швецова", "Баринова",
            "Черникова", "Лаврова", "Митрофанова", "Трифонова", "Мищенко", "Корнилова", "Астахова", "Фирсова", "Тарасенко",
            "Галимова", "Тищенко", "Долгова", "Чернышева", "Федосеева", "Долматова", "Любимая", "Березина", "Завьялова",
            "Лаптева", "Ветрова", "Сулейманова", "Сотникова", "Булатова", "Кулешова", "Бычкова", "Кошелева", "Магомедова",
            "Зиновьева", "Федоренко", "Миллер", "Колосова", "Дёмина", "Максименко", "Юрьевна", "Еремеева", "Зубкова",
            "Яковенко", "Рубцова", "Ангел", "Гуляева", "Хайруллина", "Рыжова", "Родина", "Васина", "Селиванова", "Малышка",
            "Глухова", "Винокурова", "Тюрина", "Радченко", "Аксенова", "Балашова", "Старшова", "Власенко", "Прокопенко",
            "Чиркова", "Зыкова", "Гущина", "Шубина", "Мещерякова", "Фоменко", "Широкова", "Степаненко", "Мазур", "Науменко",
            "Савчук", "Овсянникова", "Латыпова", "Иващенко", "Денисенко", "Светлова", "Гончаренко", "Куприянова", "Зинченко",
            "Шадрина", "Рыжкова", "Шарова", "Серебрякова", "Орехова", "Носкова", "Минаева", "Юрьева", "Игоревна", "Быстрова",
            "Аксёнова", "Ширяева", "Гордиенко", "Капустина", "Булгакова", "Красильникова", "Корнева", "Русакова", "Панфилова",
            "Галиева", "Якимова", "Сергиенко", "Савицкая", "Сухова", "Корниенко", "Рогова", "Седова", "Маликова", "Алексеевна",
            "Артамонова", "Козырева", "Аникина", "Щукина", "Хабибуллина", "Баженова", "Король", "Сальникова", "Сизова",
            "Москаленко", "Кулик", "Перова", "Муратова", "Лаврентьева", "Солдатова", "Коршунова", "Герасименко", "Хакимова",
            "Величко", "Лапочка", "Жук", "Минина", "Сладкая", "Рязанова", "Остапенко", "Сабирова", "Рудакова", "Калугина",
            "Крючкова", "Бабенко", "Суслова", "Самойленко", "Решетникова", "Харламова", "Беликова", "Сысоева", "Задорожная",
            "Синицына", "Вершинина", "Горбачева"};
    public static String[] listFemalePatronymics = {"Августовна", "Акимовна", "Александровна", "Алексеевна", "Анатольевна",
            "Андреевна", "Андрониковна", "Антоновна", "Аркадьевна", "Афанасьевна", "Батьковна", "Богдановна", "Борисовна",
            "Валентиновна", "Валерьевна", "Васильевна", "Вахтанговна", "Вениаминовна", "Викторовна", "Виссарионовна",
            "Витальевна", "Владимировна", "Вячеславовна", "Гавриловна", "Гаджиевна", "Геннадьевна", "Генриховна", "Георгиевна",
            "Глебовна", "Григорьевна", "Денисовна", "Дмитриевна", "Евгеньевна", "Евдокимовна", "Ивановна", "Игнатьевна",
            "Игоревна", "Ильгизовна", "Ильмировна", "Ильнуровна", "Ильсуровна", "Иоанновна", "Иосифовна", "Исаевна",
            "Каллиниковна", "Каллистратовна", "Константиновна", "Ксенофонтьевна", "Леонидовна", "Львовна", "Магомедовна",
            "Магометовна", "Макаровна", "Максимилиановна", "Максимовна", "Марковна", "Михайловна", "Натановна", "Никандровна",
            "Никаноровна", "Никитична", "Никитовна", "Никифоровна", "Никодимовна", "Николаевна", "Никоновна", "Олеговна",
            "Осиповна", "Павловна", "Петровна", "Платоновна", "Прохоровна", "Романовна", "Рудольфовна", "Рустамовна",
            "Семёновна", "Сергеевна", "Сидоровна", "Сильвестровна", "Соломоновна", "Станиславовна", "Степановна", "Тимофеевна",
            "Фёдоровна", "Филипповна", "Юрьевна", "Яковлевна", "Ярославовна"};

    public static int getRandom(int intRange) {
        return (int) (Math.random() * intRange);
    }

    public static String getRNDPhone(int range) {
        StringBuilder phone = new StringBuilder("+7(921)-");
        phone.append(getRandom(range));
        phone.append(getRandom(range));
        phone.append(getRandom(range));
        phone.append("-");
        phone.append(getRandom(range));
        phone.append(getRandom(range));
        phone.append("-");
        phone.append(getRandom(range));
        phone.append(getRandom(range));

        return phone.toString();
    }

    public static Contact generatingContact() {
        Contact contact;
        if (getRandom(2) == 0) {
            contact = new Contact(listFemaleNames[getRandom(listFemaleNames.length)],
                    listFemaleSurnames[getRandom(listFemaleSurnames.length)],
                    listFemalePatronymics[getRandom(listFemalePatronymics.length)],
                    Gender.FEMALE, getRNDPhone(9));
        } else {
            contact = new Contact(listManNames[getRandom(listManNames.length)],
                    listManSurnames[getRandom(listManSurnames.length)],
                    listManPatronymics[getRandom(listManPatronymics.length)],
                    Gender.MAN, getRNDPhone(9));
        }
        return contact;
    }

    public static Contact generatingContactLimit() {
        Contact contact;
        if (getRandom(2) == 0) {
            contact = new Contact(listFemaleNames[getRandom(9)],
                    listFemaleSurnames[getRandom(9)],
                    listFemalePatronymics[getRandom(9)],
                    Gender.FEMALE, getRNDPhone(9));
        } else {
            contact = new Contact(listManNames[getRandom(9)],
                    listManSurnames[getRandom(9)],
                    listManPatronymics[getRandom(9)],
                    Gender.MAN, getRNDPhone(9));
        }
        return contact;
    }

    public static Map<String, PhoneBook> formationGroupsByFirstSymbols(int numberOfSymbols, Contact contact, Map<String, PhoneBook> contactGroup) {

        while (numberOfSymbols > 0) {
            String nameGroup = contact.getSurname().substring(0, numberOfSymbols);

            if (contactGroup.containsKey(nameGroup)) {
                contactGroup.get(nameGroup).addContactInGroup(contact);
            } else {
                ArrayList<Contact> contacts = new ArrayList<>();
                contacts.add(contact);
                contactGroup.put(nameGroup, new PhoneBook(nameGroup, contacts));
            }
            numberOfSymbols--;
        }
        return contactGroup;
    }

    public static Map<String, PhoneBook> formationContacts(int number, Map<String, PhoneBook> contacts) {
        Map<String, PhoneBook> contactGroup = new HashMap<>();
        int recordsCreated = 0;
        long start = (new Date()).getTime();
        for (int createMap = 0; createMap < number; createMap++) {
            Contact contact = generatingContact();
            String phone = contact.getPhoneNumber();
            contactGroup = DataGenerator.formationGroupsByFirstSymbols(3, contact, contacts);

        }
        System.out.println("создано: " + recordsCreated + " записей");
        System.out.println("за " + (((new Date()).getTime()) - start) + " миллисекунд");
        return contactGroup;
    }
}

